%% 非潮流计算noplf

%% 下面尝试接入分布式电源
 %接入3节点
 Bus=[1.0000         0         0             
      2.0000    0.0100    0.0060
      3.0000    0.0090    0.0040
      4.0000    0.0120    0.0080
      5.0000    0.0060    0.0030
      6.0000    0.0060    0.0020
      7.0000    0.0200    0.0100
      8.0000    0.0200    0.0100
      9.0000    0.0060    0.0020
     10.0000    0.0060    0.0020
     11.0000    0.0045    0.0030
     12.0000    0.0060    0.0035
     13.0000    0.0060    0.0035
     14.0000    0.0120    0.0080
     15.0000    0.0060    0.0010
     16.0000    0.0060    0.0020
     17.0000    0.0060    0.0020
     18.0000    0.0090    0.0040
     19.0000    0.0090    0.0040
     20.0000    0.0090    0.0040
     21.0000    0.0090    0.0040
     22.0000    0.0090    0.0040
     23.0000    0.0090    0.0050
     24.0000    0.0420    0.0200
     25.0000    0.0420    0.0200
     26.0000    0.0060    0.0025
     27.0000    0.0060    0.0025
     28.0000    0.0060    0.0020
     29.0000    0.0120    0.0600
     30.0000    0.0200    0.0600
     31.0000    0.0150    0.0100
     32.0000    0.0210    0.0100
     33.0000    0.0060    0.0040];%33节点数据每个节点的负荷功率，已做标幺值换算

%disp('请输入支路矩阵，第一列存支路号，第2列存支路首节点，第3列存支路尾节点，第4存支路电阻，第5列存支路电抗');
Branch=[1  1  2  0.005752591	 0.002932449
2  2  3  0.030759517	 0.015666764
3  3  4  0.022835666	 0.011629967
4  4  5  0.023777793	 0.01211039
5  5  6  0.051099481	 0.044111518
6  6  7  0.011679881	 0.038608497
7  7  8  0.044386045	 0.014668484
8  8  9  0.064264305	 0.046170471
9  9  10 0.065137800     0.046170471
10 10 11  0.012266371    0.004055514
11 11 12  0.023359763    0.007724195
12 12 13  0.091592232	 0.072063371
13 13 14  0.033791794	 0.044479634
14 14 15  0.036873985	 0.03281847
15 15 16  0.046563544	 0.034003928
16 16 17   0.08042397	 0.107377542
17 17 18  0.023210021	 0.035813312
18  2 19  0.010232375	 0.009764431
19  19 20 0.093850842	 0.084566834
20  20 21 0.025549741	 0.029848586
21  21 22 0.044230064	 0.058480517
22  3  23 0.028151509	 0.019235617
23  23 24 0.056028491	 0.044242542
24  24 25 0.055903706	 0.043743402
25  6  26 0.012665683	 0.006451387
26  26 27 0.017731957	 0.009028199
27  27 28 0.066073688	 0.058255904
28  28 29 0.050176072	 0.043712206
29  29 30 0.031664208	 0.016128469
30  30 31 0.06079528	 0.060084005
31  31 32 0.01937288	 0.022579856
32  32 33 0.021275852	 0.033454874];%每条支路的阻抗值，以按z=u^2/s=16.02756做标幺值换算

Ppv=0.1;
Pwind=0.05;
Qwind=0.102;


Bus(17,2)=Bus(17,2)-Ppv;
Bus(24,2)=Bus(24,2)-Pwind;
Bus(24,3)=Bus(24,3)-Qwind;


%%本段程序判断所选线路是否收敛;节点电压，支路电流功率损耗
[busnum,dump]=size(Bus);
Vbus=ones(busnum,1);  %取额定电压10kV    
Vbus(1,1)=1.0;         %x设定线路首端电压为额定电压,可以视为公共连接点（pcc）
Vbus2=Vbus;             %迭代后的电压矩阵
[branchnum,dump]=size(Branch);
k=0;  %迭代次数
Ploss=zeros(branchnum,1);%存支路的有功损耗  
Qloss=zeros(branchnum,1);%支路无功损耗
I=zeros(branchnum,1);
F=zeros(busnum,1); %%%判断节点是否收敛
%%本段程序将支路重新排序   s1为排好序的支路矩阵
TempBranch=Branch;
n=1;
s2=[];         %这段重新排列支路应该没有问题
while ~isempty(TempBranch)
    [s,dump]=size(TempBranch);%s为支路数  
    m=1;
    while s>0
       i=find(TempBranch(:,2)==TempBranch(s,3));%末端节点是否为其他支路首端节点
        if isempty(i)
            s1(n,:)=TempBranch(s,:);%如果i是空集则该节点为叶节点
            n=n+1;
        else s2(m,:)=TempBranch(s,:);%如果i不是空集则该节点为非叶节点
            m=m+1;
        end
        s=s-1;
   end
    TempBranch=s2;             %将s2赋值给TempBranch.重复上述判断，直到TempBranch为空集为止
    s2=[];
end
    %前推进行支路功率计算
    while k<10  %(一般取3~5次迭代即可收敛），迭代次数
    Pij1=zeros(busnum,1); %该支路首端节点及与其相连的其他后续支路的功率情况
    Qij1=zeros(busnum,1);
      for s=1:branchnum        
        ii=s1(s,2);      %取排好序的支路首节点   
        jj=s1(s,3);      %取排好序的支路尾节点   
        Pload=Bus(jj,2);
        Qload=Bus(jj,3); %节点有功和无功负荷
        R=s1(s,4);
        X=s1(s,5);
        VV=Vbus(jj);
        Pij0=Pij1(jj); %该支路末端节点的后续功率
        Qij0=Qij1(jj);
        II=((Pload+Pij0)^2+(Qload+Qij0)^2)/(VV^2);    %支路电流的平方
        Ploss(s1(s,1))=II*R;                          %支路有功和无功损耗    这里有待改进。显现Ploss
        Qloss(s1(s,1))=II*X;
        P(s1(s,1))=Pload+Ploss(s1(s,1))+Pij0;       %支路功率，包括后续节点功率和网络损耗
        Q(s1(s,1))=Qload+Qloss(s1(s,1))+Qij0;%;
        Pij1(ii)=Pij1(ii)+P(s1(s,1));               %支路首端功率单位MW
        Qij1(ii)=Qij1(ii)+Q(s1(s,1));
    end
    %%回推计算节点电压
for s=branchnum:-1:1
    ii=s1(s,3); 
    kk=s1(s,2);
    R=s1(s,4);
    X=s1(s,5);
    D1U=(P(s1(s,1))*R+Q(s1(s,1))*X)/Vbus(kk);
    D2U=(P(s1(s,1))*X-Q(s1(s,1))*R)/Vbus(kk);
    Vbus(ii)=(Vbus(kk)-D1U)^2+(D2U)^2;
    Vbus(ii)=sqrt(Vbus(ii));           %开根计算出节点电压幅值
    degreebus(ii)=-atand((-D2U)/(Vbus(kk)-D1U))
   end
   %利用上步电压前推再次计算支路功率
    Pij2=zeros(busnum,1); 
    Qij2=zeros(busnum,1);
 for s=1:branchnum        
        ii=s1(s,2);        
        jj=s1(s,3);
        Pload=Bus(jj,2);
        Qload=Bus(jj,3);%节点有功和无功负荷
        R=s1(s,4);
        X=s1(s,5);
        VV=Vbus(jj);
        Pij0=Pij2(jj);%该支路末端节点的后续功率
        Qij0=Qij2(jj);
        II=((Pload+Pij0)^2+(Qload+Qij0)^2)/(VV^2);%支路电流的平方
        I(s1(s,1))=sqrt(II)*1000;                         %单位A
        Ploss(s1(s,1))=II*R;                          %支路有功和无功损耗  单位MW
        Qloss(s1(s,1))=II*X;
        P(s1(s,1))=Pload+Ploss(s1(s,1))+Pij0;%支路功率，包括后续节点功率和网络损耗
        Q(s1(s,1))=Qload+Qloss(s1(s,1))+Qij0;
        Pij2(ii)=Pij2(ii)+P(s1(s,1));           %支路首端功率
        Qij2(ii)=Qij2(ii)+Q(s1(s,1));%;
 end
 
 P=0;Q=0;
 for s=1:branchnum    %计算总有功损耗 和 总无功损耗
     P=P+Ploss(s);
     Q=Q+Qloss(s);
 end
 for j=1:busnum
     ddp=abs(Pij1(j)-Pij2(j));
     ddq=abs(Qij1(j)-Qij2(j));
     L1=(ddp<0.00000001)&(ddq<0.00000001);  
     F(j,1)=L1;
 end
 if F==1
     Vbus2=Vbus;
     break;
 end
 k=k+1;
 end
    

 figure(1)
 plot(Vbus2,'-r<')
 title('各节点电压')
 xlabel('节点编号')
 ylabel('节点电压')
 grid on
 hold on


 figure(2)
 plot(degreebus,'-r<')
 title('各节点相角')
 xlabel('节点编号')
 ylabel('节点相位（度数）')
 grid on
 hold on

 figure(3)
 plot(Ploss*10000,'-r<')
 title('各支路网损情况')
 xlabel('支路编号')
 ylabel('支路网损')
 grid on
 hold on
 
 
 d=0;
 for t=1:33
     if Vbus2(t)<0.93
         d=d+1;
     else if  Vbus2(t)>1.07
        d=d+1;
         end
     end
 end
 [p,q]=min(Vbus);
     %h=abs(Vbus2-Vbus3);
     %g=max(h);
 disp('系统最低电压,节点号：');
 disp([p,q]);
% disp('并网前后节点电压变化最大值：');
%disp(g);
 disp('节点接入DG时电压越限个数：');
 disp(d);
 disp('    ');

 






